---
kind: method
id: M:Autodesk.Revit.DB.ExternalService.ExternalServiceId.op_Equality(Autodesk.Revit.DB.ExternalService.ExternalServiceId,Autodesk.Revit.DB.ExternalService.ExternalServiceId)
source: html/4f8d7981-c9fe-e65b-85bc-4fe1402b6020.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServiceId.op_Equality Method

Compares two ExternalServiceId instances.

## Syntax (C#)
```csharp
public static bool operator ==(
	ExternalServiceId first,
	ExternalServiceId second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.ExternalService.ExternalServiceId`) - The first ExternalServiceId.
- **second** (`Autodesk.Revit.DB.ExternalService.ExternalServiceId`) - The second ExternalServiceId.

## Returns
True if the inputs are identical, false if they are different.